```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.ibm_is_vpc.basic_vpc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "ibm_is_vpc" "basic_vpc" {
      + access_tags                 = (known after apply)
      + classic_access              = (known after apply)
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_address_prefixes    = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + dns                         = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + identifier                  = "r006-c0e74db4-09e9-437e-b0da-b0932d596a8f"
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)
    }

  # module.basic_vpc.ibm_is_vpc.vpc[0] will be updated in-place
  ~ resource "ibm_is_vpc" "vpc" {
        id                          = "r006-c0e74db4-09e9-437e-b0da-b0932d596a8f"
      ~ name                        = "tf-ibm-vpc-vpc" -> "tf-ibm-vpc"
        tags                        = []
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.ibm_is_vpn_server.vpn will be updated in-place
  ~ resource "ibm_is_vpn_server" "vpn" {
        id                         = "r006-60ef7325-8ab8-4812-9609-6fc010f64ebc"
        name                       = "tf-ibm-c2s-vpn"
      ~ subnets                    = [
          - "0717-fb12804e-2d0c-428d-9fa4-74e0182f1cb4",
          - "0727-21aaf2d9-467e-41ad-90d2-4920a47960a1",
        ] -> (known after apply)
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

```

Changes are update-in-place, no breaking changes. The only change is the renaming of the vpc.
Skipping the upgrade test